export const courses = [
  {
    id: 1,
    name: "Первый курс",
    subjects: [
      {
        id: 1,
        name: "Программирование",
        description: "Основы программирования и алгоритмы",
        topics: [
          {
            id: 101,
            title: "Введение в алгоритмы",
            content:  `
\`\`\`html            
<!DOCTYPE html>
<html>
<head>
  <meta charset="UTF-8">
  <title>Заголовок страницы</title>
</head>
<body>
  <!-- Здесь будет содержимое страницы -->
</body>
</html>
\`\`\`
            
            [afdadad](https://github.com/ReeneQo/hakawt/branches)` 
          },
          {
            id: 102,
            title: "Введение в алгоритмы",
            content: ``
          },
          {
            id: 104,
            title: "Введение в алгоритмы",
            content: `# Введение в алгоритмы

`
          },
          {
            id: 105,
            title: "Введение в алгоритмы",
            content: `# Введение в алгоритмы

`
          },
          {
            id: 106,
            title: "Введение в алгоритмы",
            content: `# Введение в алгоритмы

`
          }
        ]
      },
      {
        id: 2,
        name: "Математический анализ",
        description: "Высшая математика и calculus",
        topics: [
          {
            id: 201,
            title: "Пределы функций",
            content: `# Пределы функций

## Определение предела
Предел функции — это значение, к которому стремится функция при приближении аргумента к заданной точке.

### Основные свойства пределов:
1. Единственность предела
2. Ограниченность функции
3. Сохранение знака`
          }
        ]
      },
      {
        id: 3,
        name: "Обществознание",
        description: "Высшая математика и calculus",
        topics: [
          {
            id: 301,
            title: "Пределы функций",
            content: `# Пределы функций

## Определение предела
Предел функции — это значение, к которому стремится функция при приближении аргумента к заданной точке.

### Основные свойства пределов:
1. Единственность предела
2. Ограниченность функции
3. Сохранение знака`
          }
        ]
      },
    ]
  },
  {
    id: 2,
    name: "Второй курс",
    subjects: [
      {
        id: 21,
        name: "Микроэкономика",
        description: "Основы экономической теории",

        topics: [
          {
            id: 2101,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 22,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 2201,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 23,
        name: "Микроэкономика",
        description: "Основы экономической теории",

        topics: [
          {
            id: 2301,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
    ]
  },
  {
    id: 3,
    name: "Третий курс",
    subjects: [
      {
        id: 31,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 3101,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 32,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 3201,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 33,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 3301,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 34,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 3401,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 35,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 3501,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
    ]
  },
  {
    id: 4,
    name: "Четвёртый курс",
    subjects: [
      {
        id: 41,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 4101,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 42,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 4201,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 43,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 4301,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      {
        id: 44,
        name: "Микроэкономика",
        description: "Основы экономической теории",
        topics: [
          {
            id: 4401,
            title: "Спрос и предложение",
            content: ``
          }
        ]
      },
      
    ]
  },
  
];